thom24/pdk/packages/ti/board/src/j7200_evm/j7200_evm_baseboard_pinmux.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "J7200_DRA821_SR1.0_alpha" --package "ALM" --part "Default"
 * @versions {"data":"20201003","timestamp":"2020060911","tool":"1.4.0+1234","templates":"20190604"}
 */

/**
 * Import the modules used in this configuration.
 */
const powerDomains = scripting.addModule("/ti/corePinmux/powerDomains");

/**
 * Write custom configuration values to the imported modules.
 */
powerDomains.CANUART          = "3.3 V";
powerDomains.MMC1             = "3.3 V";
powerDomains.MCU_CPSW2G_RGMII = "3.3 V";
powerDomains.MCU_GENERAL      = "3.3 V";
powerDomains.GENERAL          = "3.3 V";

/**
 * These are the peripherals and settings in this configuration
 */
const iDDRSS1                           = scripting.addPeripheral("DDRSS");
iDDRSS1.$name                           = "MyDDRSS0";
iDDRSS1.$assignVoltage                  = "1.1 V";
iDDRSS1.CKN.$assign                     = "H1";
iDDRSS1.RET.$assign                     = "R5";
iDDRSS1.CKP.$assign                     = "G1";
iDDRSS1.RESETn.$assign                  = "J5";
iDDRSS1.CA0.$assign                     = "G4";
iDDRSS1.CA1.$assign                     = "H3";
iDDRSS1.CA2.$assign                     = "J4";
iDDRSS1.CA3.$assign                     = "K1";
iDDRSS1.CA4.$assign                     = "J2";
iDDRSS1.CA5.$assign                     = "H5";
iDDRSS1.CKE0.$assign                    = "G2";
iDDRSS1.CKE1.$assign                    = "H2";
iDDRSS1.CSn0_0.$assign                  = "G3";
iDDRSS1.CSn0_1.$assign                  = "K2";
iDDRSS1.CSn1_0.$assign                  = "G5";
iDDRSS1.CSn1_1.$assign                  = "J3";
iDDRSS1.DM0.$assign                     = "A3";
iDDRSS1.DM1.$assign                     = "E4";
iDDRSS1.DM2.$assign                     = "N1";
iDDRSS1.DM3.$assign                     = "R4";
iDDRSS1.DQ0.$assign                     = "B4";
iDDRSS1.DQ1.$assign                     = "A4";
iDDRSS1.DQ2.$assign                     = "C4";
iDDRSS1.DQ3.$assign                     = "C1";
iDDRSS1.DQ4.$assign                     = "C3";
iDDRSS1.DQ5.$assign                     = "C2";
iDDRSS1.DQ6.$assign                     = "A2";
iDDRSS1.DQ7.$assign                     = "B3";
iDDRSS1.DQ8.$assign                     = "D1";
iDDRSS1.DQ9.$assign                     = "D2";
iDDRSS1.DQ10.$assign                    = "F2";
iDDRSS1.DQ11.$assign                    = "E3";
iDDRSS1.DQ12.$assign                    = "F3";
iDDRSS1.DQ13.$assign                    = "F4";
iDDRSS1.DQ14.$assign                    = "D4";
iDDRSS1.DQ15.$assign                    = "F5";
iDDRSS1.DQ16.$assign                    = "K4";
iDDRSS1.DQ17.$assign                    = "L4";
iDDRSS1.DQ18.$assign                    = "M4";
iDDRSS1.DQ19.$assign                    = "L3";
iDDRSS1.DQ20.$assign                    = "L2";
iDDRSS1.DQ21.$assign                    = "L1";
iDDRSS1.DQ22.$assign                    = "M3";
iDDRSS1.DQ23.$assign                    = "N2";
iDDRSS1.DQ24.$assign                    = "R3";
iDDRSS1.DQ25.$assign                    = "T1";
iDDRSS1.DQ26.$assign                    = "P1";
iDDRSS1.DQ27.$assign                    = "P2";
iDDRSS1.DQ28.$assign                    = "N4";
iDDRSS1.DQ29.$assign                    = "P3";
iDDRSS1.DQ30.$assign                    = "P4";
iDDRSS1.DQ31.$assign                    = "N5";
iDDRSS1.DQS0N.$assign                   = "B1";
iDDRSS1.DQS0P.$assign                   = "B2";
iDDRSS1.DQS1N.$assign                   = "E1";
iDDRSS1.DQS1P.$assign                   = "E2";
iDDRSS1.DQS2N.$assign                   = "M1";
iDDRSS1.DQS2P.$assign                   = "M2";
iDDRSS1.DQS3N.$assign                   = "R1";
iDDRSS1.DQS3P.$assign                   = "R2";
const iDEBUGSS1                         = scripting.addPeripheral("DEBUGSS");
iDEBUGSS1.$name                         = "MyDEBUGSS1";
iDEBUGSS1.CLK.$used                     = false;
iDEBUGSS1.CTL.$used                     = false;
iDEBUGSS1.TMS.$assign                   = "U4";
iDEBUGSS1.TDI.$assign                   = "F19";
iDEBUGSS1.TDO.$assign                   = "F21";
iDEBUGSS1.DATA0.$used                   = false;
iDEBUGSS1.DATA1.$used                   = false;
iDEBUGSS1.DATA2.$used                   = false;
iDEBUGSS1.DATA3.$used                   = false;
iDEBUGSS1.DATA4.$used                   = false;
iDEBUGSS1.DATA5.$used                   = false;
iDEBUGSS1.DATA6.$used                   = false;
iDEBUGSS1.DATA7.$used                   = false;
iDEBUGSS1.DATA8.$used                   = false;
iDEBUGSS1.DATA9.$used                   = false;
iDEBUGSS1.DATA10.$used                  = false;
iDEBUGSS1.DATA11.$used                  = false;
iDEBUGSS1.DATA12.$used                  = false;
iDEBUGSS1.DATA13.$used                  = false;
iDEBUGSS1.DATA14.$used                  = false;
iDEBUGSS1.DATA15.$used                  = false;
iDEBUGSS1.DATA16.$used                  = false;
iDEBUGSS1.DATA17.$used                  = false;
iDEBUGSS1.DATA18.$used                  = false;
iDEBUGSS1.DATA19.$used                  = false;
iDEBUGSS1.DATA20.$used                  = false;
iDEBUGSS1.DATA21.$used                  = false;
iDEBUGSS1.DATA22.$used                  = false;
iDEBUGSS1.DATA23.$used                  = false;
iDEBUGSS1.EMU0.$assign                  = "A13";
iDEBUGSS1.EMU1.$assign                  = "D12";
iDEBUGSS1.TCK.$assign                   = "B15";
iDEBUGSS1.TRSTn.$assign                 = "B20";
const iGPIO1                            = scripting.addPeripheral("GPIO");
iGPIO1.$name                            = "MyGPIO1";
iGPIO1.$assignVoltage                   = "3.3 V";
iGPIO1["4"].$assign                     = "AA20";
iGPIO1["4"].$used                       = true;
iGPIO1["12"].$assign                    = "V16";
iGPIO1["12"].$used                      = true;
iGPIO1["27"].$assign                    = "T14";
iGPIO1["27"].$used                      = true;
iGPIO1["28"].$assign                    = "U18";
iGPIO1["28"].$used                      = true;
iGPIO1["44"].$assign                    = "U13";
iGPIO1["44"].$used                      = true;
iGPIO1["55"].$assign                    = "T5";
iGPIO1["55"].$used                      = true;
const iI2C1                             = scripting.addPeripheral("I2C");
iI2C1.$name                             = "MyI2C2";
iI2C1.$assign                           = "I2C2";
iI2C1.$assignVoltage                    = "3.3 V";
iI2C1.SCL.$assign                       = "Y1";
iI2C1.SDA.$assign                       = "V4";
const iI2C2                             = scripting.addPeripheral("I2C");
iI2C2.$name                             = "MyI2C0";
iI2C2.$assign                           = "I2C0";
iI2C2.$assignVoltage                    = "3.3 V";
iI2C2.SCL.$assign                       = "V3";
iI2C2.SDA.$assign                       = "W2";
const iI2C3                             = scripting.addPeripheral("I2C");
iI2C3.$name                             = "MyI2C1";
iI2C3.$assign                           = "I2C1";
iI2C3.$assignVoltage                    = "3.3 V";
iI2C3.SCL.$assign                       = "U3";
iI2C3.SDA.$assign                       = "T3";
const iMCAN1                            = scripting.addPeripheral("MCAN");
iMCAN1.$name                            = "MyMCAN0";
iMCAN1.$assign                          = "MCAN0";
iMCAN1.RX.$assign                       = "V20";
iMCAN1.TX.$assign                       = "V18";
const iMCAN2                            = scripting.addPeripheral("MCAN");
iMCAN2.$name                            = "MyMCAN3";
iMCAN2.$assign                          = "MCAN3";
iMCAN2.RX.$assign                       = "W16";
iMCAN2.TX.$assign                       = "Y21";
const iMCAN3                            = scripting.addPeripheral("MCAN");
iMCAN3.$name                            = "MyMCAN4";
iMCAN3.$assign                          = "MCAN4";
iMCAN3.$assignVoltage                   = "3.3 V";
iMCAN3.RX.$assign                       = "Y20";
iMCAN3.TX.$assign                       = "W15";
const iMCAN4                            = scripting.addPeripheral("MCAN");
iMCAN4.$name                            = "MyMCAN5";
iMCAN4.$assign                          = "MCAN5";
iMCAN4.$assignVoltage                   = "3.3 V";
iMCAN4.RX.$assign                       = "V19";
iMCAN4.TX.$assign                       = "V21";
const iMCAN5                            = scripting.addPeripheral("MCAN");
iMCAN5.$name                            = "MyMCAN6";
iMCAN5.$assign                          = "MCAN6";
iMCAN5.$assignVoltage                   = "3.3 V";
iMCAN5.RX.$assign                       = "U14";
iMCAN5.TX.$assign                       = "T13";
const iMCAN6                            = scripting.addPeripheral("MCAN");
iMCAN6.$name                            = "MyMCAN7";
iMCAN6.$assign                          = "MCAN7";
iMCAN6.$assignVoltage                   = "3.3 V";
iMCAN6.RX.$assign                       = "U15";
iMCAN6.TX.$assign                       = "U16";
const iMCAN7                            = scripting.addPeripheral("MCAN");
iMCAN7.$name                            = "MyMCAN10";
iMCAN7.$assign                          = "MCAN10";
iMCAN7.$assignVoltage                   = "3.3 V";
iMCAN7.RX.$assign                       = "U20";
iMCAN7.TX.$assign                       = "U17";
const iMCAN8                            = scripting.addPeripheral("MCAN");
iMCAN8.$name                            = "MyMCAN8";
iMCAN8.$assign                          = "MCAN8";
iMCAN8.RX.$assign                       = "U19";
iMCAN8.TX.$assign                       = "T15";
const iMCU_ADC1                         = scripting.addPeripheral("MCU_ADC");
iMCU_ADC1.$name                         = "MyMCU_ADC0";
iMCU_ADC1.$assignVoltage                = "1.8 V";
iMCU_ADC1.$useCase                      = "ADC_0";
iMCU_ADC1.AIN0.$assign                  = "H17";
iMCU_ADC1.AIN0.$used                    = true;
iMCU_ADC1.AIN1.$assign                  = "K18";
iMCU_ADC1.AIN1.$used                    = true;
iMCU_ADC1.AIN2.$assign                  = "M17";
iMCU_ADC1.AIN2.$used                    = true;
iMCU_ADC1.AIN3.$assign                  = "L18";
iMCU_ADC1.AIN3.$used                    = true;
iMCU_ADC1.AIN4.$assign                  = "J18";
iMCU_ADC1.AIN4.$used                    = true;
iMCU_ADC1.AIN5.$assign                  = "J17";
iMCU_ADC1.AIN5.$used                    = true;
iMCU_ADC1.AIN6.$assign                  = "K17";
iMCU_ADC1.AIN6.$used                    = true;
iMCU_ADC1.AIN7.$assign                  = "L17";
iMCU_ADC1.AIN7.$used                    = true;
const iMCU_FSS0_OSPI1                   = scripting.addPeripheral("MCU_FSS0_OSPI");
iMCU_FSS0_OSPI1.$name                   = "MyMCU_FSS0_OSPI0";
iMCU_FSS0_OSPI1.$assignVoltage          = "1.8 V";
iMCU_FSS0_OSPI1.$useCase                = "MCU_FSS0_OSPI_4";
iMCU_FSS0_OSPI1.CLK.$assign             = "B6";
iMCU_FSS0_OSPI1.CSn0.$assign            = "D6";
iMCU_FSS0_OSPI1.CSn0.$used              = true;
iMCU_FSS0_OSPI1.D0.$assign              = "D8";
iMCU_FSS0_OSPI1.D1.$assign              = "C7";
iMCU_FSS0_OSPI1.D2.$assign              = "C5";
iMCU_FSS0_OSPI1.D3.$assign              = "A5";
iMCU_FSS0_OSPI1.D4.$assign              = "A6";
iMCU_FSS0_OSPI1.D5.$assign              = "B8";
iMCU_FSS0_OSPI1.D6.$assign              = "A8";
iMCU_FSS0_OSPI1.D7.$assign              = "A7";
iMCU_FSS0_OSPI1.DQS.$assign             = "B7";
iMCU_FSS0_OSPI1.LBCLKO.$used            = false;
iMCU_FSS0_OSPI1.ECC_FAIL.$used          = false;
iMCU_FSS0_OSPI1.RESET_OUT0.$used        = false;
iMCU_FSS0_OSPI1.RESET_OUT1.$used        = false;
const iMCU_I2C1                         = scripting.addPeripheral("MCU_I2C");
iMCU_I2C1.$name                         = "MyMCU_I2C0";
iMCU_I2C1.$assign                       = "MCU_I2C0";
iMCU_I2C1.$assignVoltage                = "3.3 V";
iMCU_I2C1.SCL.$assign                   = "G21";
iMCU_I2C1.SDA.$assign                   = "G20";
const iMCU_I3C1                         = scripting.addPeripheral("MCU_I3C");
iMCU_I3C1.$name                         = "MyMCU_I3C0";
iMCU_I3C1.$assignVoltage                = "3.3 V";
iMCU_I3C1.SCL.$assign                   = "C21";
iMCU_I3C1.SDA.$assign                   = "C19";
iMCU_I3C1.SDAPULLEN.$assign             = "C16";
const iMCU_MCAN1                        = scripting.addPeripheral("MCU_MCAN");
iMCU_MCAN1.$name                        = "MyMCU_MCAN0";
iMCU_MCAN1.$assign                      = "MCU_MCAN0";
iMCU_MCAN1.$assignVoltage               = "3.3 V";
iMCU_MCAN1.RX.$assign                   = "A17";
iMCU_MCAN1.TX.$assign                   = "A16";
const iMCU_MCAN2                        = scripting.addPeripheral("MCU_MCAN");
iMCU_MCAN2.$name                        = "MyMCU_MCAN1";
iMCU_MCAN2.$assign                      = "MCU_MCAN1";
iMCU_MCAN2.$assignVoltage               = "3.3 V";
iMCU_MCAN2.RX.$assign                   = "B16";
iMCU_MCAN2.TX.$assign                   = "D13";
const iMCU_MDIO1                        = scripting.addPeripheral("MCU_MDIO");
iMCU_MDIO1.$name                        = "MyMCU_MDIO0";
iMCU_MDIO1.$assignVoltage               = "3.3 V";
iMCU_MDIO1.MDC.$assign                  = "D9";
iMCU_MDIO1.MDIO.$assign                 = "C9";
const iMCU_RGMII1                       = scripting.addPeripheral("MCU_RGMII");
iMCU_RGMII1.$name                       = "MyMCU_RGMII1";
iMCU_RGMII1.$assignVoltage              = "3.3 V";
iMCU_RGMII1.RD0.$assign                 = "A9";
iMCU_RGMII1.RD1.$assign                 = "B9";
iMCU_RGMII1.RD2.$assign                 = "A10";
iMCU_RGMII1.RD3.$assign                 = "C10";
iMCU_RGMII1.RXC.$assign                 = "B10";
iMCU_RGMII1.RX_CTL.$assign              = "A11";
iMCU_RGMII1.TD0.$assign                 = "D10";
iMCU_RGMII1.TD1.$assign                 = "B11";
iMCU_RGMII1.TD2.$assign                 = "B12";
iMCU_RGMII1.TD3.$assign                 = "C12";
iMCU_RGMII1.TXC.$assign                 = "A12";
iMCU_RGMII1.TX_CTL.$assign              = "D11";
const iMCU_UART1                        = scripting.addPeripheral("MCU_UART");
iMCU_UART1.$name                        = "MyMCU_UART0";
iMCU_UART1.$assignVoltage               = "3.3 V";
iMCU_UART1.$useCase                     = "MCU_UART_1";
iMCU_UART1.RXD.$assign                  = "D20";
iMCU_UART1.TXD.$assign                  = "D19";
iMCU_UART1.CTSn.$assign                 = "E20";
iMCU_UART1.RTSn.$assign                 = "E21";
const iMDIO1                            = scripting.addPeripheral("MDIO");
iMDIO1.$name                            = "MyMDIO0";
iMDIO1.$assignVoltage                   = "3.3 V";
iMDIO1.MDC.$assign                      = "W19";
iMDIO1.MDIO.$assign                     = "W14";
const iMMCSD1                           = scripting.addPeripheral("MMCSD");
iMMCSD1.$name                           = "MyMMCSD1";
iMMCSD1.$assign                         = "MMC1";
iMMCSD1.$assignVoltage                  = "3.3 V";
iMMCSD1.$useCase                        = "MMCSD_2";
iMMCSD1.CMD.$assign                     = "M20";
iMMCSD1.CLK.$assign                     = "P21";
iMMCSD1.DAT0.$assign                    = "M19";
iMMCSD1.DAT1.$assign                    = "N21";
iMMCSD1.DAT2.$assign                    = "N20";
iMMCSD1.DAT3.$assign                    = "N19";
iMMCSD1.SDCD.$assign                    = "V1";
iMMCSD1.SDWP.$used                      = false;
const iMMCSD2                           = scripting.addPeripheral("MMCSD");
iMMCSD2.$name                           = "MyMMCSD0";
iMMCSD2.$assign                         = "MMC0";
iMMCSD2.$assignVoltage                  = "1.8 V";
iMMCSD2.$useCase                        = "MMCSD_5";
iMMCSD2.CMD.$assign                     = "R17";
iMMCSD2.CLK.$assign                     = "P18";
iMMCSD2.DS.$assign                      = "P19";
iMMCSD2.DS.$used                        = true;
iMMCSD2.DAT0.$assign                    = "R16";
iMMCSD2.DAT1.$assign                    = "P17";
iMMCSD2.DAT2.$assign                    = "R18";
iMMCSD2.DAT3.$assign                    = "R20";
iMMCSD2.DAT4.$assign                    = "R19";
iMMCSD2.DAT5.$assign                    = "P16";
iMMCSD2.DAT6.$assign                    = "R21";
iMMCSD2.DAT7.$assign                    = "T21";
const iOSC1                             = scripting.addPeripheral("OSC");
iOSC1.$name                             = "MyOSC1";
iOSC1.$assignVoltage                    = "1.8 V";
iOSC1.XO.$assign                        = "J19";
iOSC1.XI.$assign                        = "K19";
const iPCIE1                            = scripting.addPeripheral("PCIE");
iPCIE1.$name                            = "MyPCIE1";
iPCIE1.$assignVoltage                   = "1.8 V";
iPCIE1.$useCase                         = "PCIE_2";
iPCIE1.CLKREQn.$used                    = false;
iPCIE1.TX0_N.$assign                    = "W11";
iPCIE1.TX1_N.$assign                    = "Y10";
iPCIE1.TX0_P.$assign                    = "W12";
iPCIE1.TX1_P.$assign                    = "Y11";
iPCIE1.RX0_N.$assign                    = "AA11";
iPCIE1.RX1_N.$assign                    = "W8";
iPCIE1.RX0_P.$assign                    = "AA12";
iPCIE1.RX1_P.$assign                    = "W9";
const iRGMII1                           = scripting.addPeripheral("RGMII");
iRGMII1.$name                           = "MyRGMII2";
iRGMII1.$assign                         = "RGMII2";
iRGMII1.$assignVoltage                  = "3.3 V";
iRGMII1.RD0.$assign                     = "Y13";
iRGMII1.RD1.$assign                     = "AA15";
iRGMII1.RD2.$assign                     = "AA14";
iRGMII1.RD3.$assign                     = "AA18";
