thom24/pdk/packages/ti/board/src/j7200_evm/j7200_evm_baseboard_pinmux.syscfg
iRGMII1.RXC.$assign                     = "Y14";
iRGMII1.RX_CTL.$assign                  = "AA16";
iRGMII1.TD0.$assign                     = "W17";
iRGMII1.TD1.$assign                     = "W20";
iRGMII1.TD2.$assign                     = "V14";
iRGMII1.TD3.$assign                     = "V13";
iRGMII1.TXC.$assign                     = "W21";
iRGMII1.TX_CTL.$assign                  = "U12";
const iSERDES1                          = scripting.addPeripheral("SERDES");
iSERDES1.$name                          = "MySERDES0";
iSERDES1.$assignVoltage                 = "1.8 V";
iSERDES1.REFCLK_N.$assign               = "AA8";
iSERDES1.REFCLK_P.$assign               = "AA9";
const iSGMII1                           = scripting.addPeripheral("SGMII");
iSGMII1.$name                           = "MySGMII1";
iSGMII1.$assign                         = "SGMII1";
iSGMII1.$assignVoltage                  = "1.8 V";
iSGMII1.RXN0.$assign                    = "Y7";
iSGMII1.RXP0.$assign                    = "Y8";
iSGMII1.TXN0.$assign                    = "AA5";
iSGMII1.TXP0.$assign                    = "AA6";
const iSYSTEM1                          = scripting.addPeripheral("SYSTEM");
iSYSTEM1.$name                          = "MySYSTEM1";
iSYSTEM1.$assignVoltage                 = "3.3 V";
iSYSTEM1.AUDIO_EXT_REFCLK0.$used        = false;
iSYSTEM1.AUDIO_EXT_REFCLK1.$used        = false;
iSYSTEM1.EXTINTn.$assign                = "U6";
iSYSTEM1.EXT_REFCLK1.$used              = false;
iSYSTEM1.FCLK_MUX.$used                 = false;
iSYSTEM1.OBSCLK0.$used                  = false;
iSYSTEM1.OBSCLK1.$used                  = false;
iSYSTEM1.OBSCLK2.$used                  = false;
iSYSTEM1.RESETSTATz.$assign             = "U2";
iSYSTEM1.SOC_SAFETY_ERRORn.$assign      = "V2";
iSYSTEM1.SYNC0_OUT.$used                = false;
iSYSTEM1.SYNC1_OUT.$used                = false;
iSYSTEM1.SYNC2_OUT.$used                = false;
iSYSTEM1.SYNC3_OUT.$used                = false;
iSYSTEM1.SYSCLKOUT0.$used               = false;
const iUART1                            = scripting.addPeripheral("UART");
iUART1.$name                            = "MyUART5";
iUART1.$assign                          = "USART5";
iUART1.$assignVoltage                   = "3.3 V";
iUART1.$useCase                         = "UART_5";
iUART1.RXD.$assign                      = "Y15";
iUART1.TXD.$assign                      = "AA17";
const iUART2                            = scripting.addPeripheral("UART");
iUART2.$name                            = "MyUART6";
iUART2.$assign                          = "USART6";
iUART2.$assignVoltage                   = "3.3 V";
iUART2.$useCase                         = "UART_5";
iUART2.RXD.$assign                      = "Y16";
iUART2.TXD.$assign                      = "Y17";
const iUART3                            = scripting.addPeripheral("UART");
iUART3.$name                            = "MyUART9";
iUART3.$assign                          = "USART9";
iUART3.$assignVoltage                   = "3.3 V";
iUART3.$useCase                         = "UART_5";
iUART3.RXD.$assign                      = "AA19";
iUART3.TXD.$assign                      = "V17";
const iUART4                            = scripting.addPeripheral("UART");
iUART4.$name                            = "MyUART3";
iUART4.$assign                          = "USART3";
iUART4.$assignVoltage                   = "3.3 V";
iUART4.$useCase                         = "UART_2";
iUART4.RXD.$assign                      = "Y18";
iUART4.TXD.$assign                      = "Y19";
iUART4.CTSn.$assign                     = "T15";
iUART4.CTSn.$used                       = false;
iUART4.RTSn.$assign                     = "U19";
iUART4.RTSn.$used                       = false;
const iUART5                            = scripting.addPeripheral("UART");
iUART5.$name                            = "MyUART7";
iUART5.$assign                          = "USART7";
iUART5.$assignVoltage                   = "3.3 V";
iUART5.$useCase                         = "UART_5";
iUART5.RXD.$assign                      = "U21";
iUART5.TXD.$assign                      = "V15";
const iUART6                            = scripting.addPeripheral("UART");
iUART6.$name                            = "MyUART0";
iUART6.$assign                          = "USART0";
iUART6.$assignVoltage                   = "3.3 V";
iUART6.$useCase                         = "UART_2";
iUART6.RXD.$assign                      = "T16";
iUART6.TXD.$assign                      = "T17";
iUART6.CTSn.$assign                     = "W3";
iUART6.RTSn.$assign                     = "U5";
const iUART7                            = scripting.addPeripheral("UART");
iUART7.$name                            = "MyUART1";
iUART7.$assign                          = "USART1";
iUART7.$assignVoltage                   = "3.3 V";
iUART7.$useCase                         = "UART_5";
iUART7.RXD.$assign                      = "T18";
iUART7.TXD.$assign                      = "T20";
const iUSB1                             = scripting.addPeripheral("USB");
iUSB1.$name                             = "MyUSB0";
iUSB1.DM.$assign                        = "AA3";
iUSB1.DP.$assign                        = "AA2";
iUSB1.DRVVBUS.$assign                   = "T4";
iUSB1.ID.$assign                        = "V6";
iUSB1.VBUS.$assign                      = "Y2";
iUSB1.SSRX2N.$assign                    = "W5";
iUSB1.SSRX2P.$assign                    = "W6";
iUSB1.SSTX2N.$assign                    = "Y4";
iUSB1.SSTX2P.$assign                    = "Y5";
iUSB1.SSRX1N.$used                      = false;
iUSB1.SSRX1P.$used                      = false;
iUSB1.SSTX1N.$used                      = false;
iUSB1.SSTX1P.$used                      = false;
const iWKUP_GPIO1                       = scripting.addPeripheral("WKUP_GPIO");
iWKUP_GPIO1.$name                       = "MyWKUP_GPIO1";
iWKUP_GPIO1["0"].$assign                = "B18";
iWKUP_GPIO1["0"].$used                  = true;
iWKUP_GPIO1["1"].$assign                = "B19";
iWKUP_GPIO1["1"].$used                  = true;
iWKUP_GPIO1["2"].$assign                = "D14";
iWKUP_GPIO1["2"].$used                  = true;
iWKUP_GPIO1["3"].$assign                = "B21";
iWKUP_GPIO1["3"].$used                  = true;
iWKUP_GPIO1["6"].$assign                = "C14";
iWKUP_GPIO1["6"].$used                  = true;
iWKUP_GPIO1["7"].$assign                = "C18";
iWKUP_GPIO1["7"].$used                  = true;
iWKUP_GPIO1["17"].$assign               = "C8";
iWKUP_GPIO1["17"].$used                 = true;
iWKUP_GPIO1["56"].$assign               = "C13";
iWKUP_GPIO1["56"].$used                 = true;
iWKUP_GPIO1["57"].$assign               = "A20";
iWKUP_GPIO1["57"].$used                 = true;
iWKUP_GPIO1["58"].$assign               = "B17";
iWKUP_GPIO1["58"].$used                 = true;
iWKUP_GPIO1["59"].$assign               = "A19";
iWKUP_GPIO1["59"].$used                 = true;
iWKUP_GPIO1["77"].$assign               = "D21";
iWKUP_GPIO1["77"].$used                 = true;
iWKUP_GPIO1["78"].$assign               = "E19";
iWKUP_GPIO1["78"].$used                 = true;
iWKUP_GPIO1["80"].$assign               = "D18";
iWKUP_GPIO1["80"].$used                 = true;
iWKUP_GPIO1["84"].$assign               = "E18";
iWKUP_GPIO1["84"].$used                 = true;
const iWKUP_I2C1                        = scripting.addPeripheral("WKUP_I2C");
iWKUP_I2C1.$name                        = "MyWKUP_I2C0";
iWKUP_I2C1.$assignVoltage               = "3.3 V";
iWKUP_I2C1.SCL.$assign                  = "F20";
iWKUP_I2C1.SDA.$assign                  = "H21";
const iWKUP_OSC1                        = scripting.addPeripheral("WKUP_OSC");
iWKUP_OSC1.$name                        = "MyWKUP_OSC0";
iWKUP_OSC1.$assignVoltage               = "1.8 V";
iWKUP_OSC1.XO.$assign                   = "L21";
iWKUP_OSC1.XI.$assign                   = "K21";
iWKUP_OSC1.LF_CLKIN.$assign             = "C17";
const iWKUP_SYSTEM1                     = scripting.addPeripheral("WKUP_SYSTEM");
iWKUP_SYSTEM1.$name                     = "MyWKUP_SYSTEM1";
iWKUP_SYSTEM1.$assignVoltage            = "3.3 V";
iWKUP_SYSTEM1.MCU_CLKOUT0.$used         = false;
iWKUP_SYSTEM1.MCU_EXT_REFCLK0.$used     = false;
iWKUP_SYSTEM1.MCU_OBSCLK0.$used         = false;
iWKUP_SYSTEM1.MCU_PORz.$assign          = "G19";
iWKUP_SYSTEM1.MCU_RESETSTATz.$assign    = "B13";
iWKUP_SYSTEM1.MCU_RESETz.$assign        = "A18";
iWKUP_SYSTEM1.MCU_SAFETY_ERRORn.$assign = "G18";
iWKUP_SYSTEM1.MCU_SYSCLKOUT0.$used      = false;
iWKUP_SYSTEM1.PMIC_POWER_EN1.$assign    = "C15";
iWKUP_SYSTEM1.PMIC_WAKE0.$assign        = "T19";
iWKUP_SYSTEM1.PMIC_WAKE1.$used          = false;
iWKUP_SYSTEM1.PORz.$assign              = "H20";
iWKUP_SYSTEM1.RESET_REQz.$assign        = "A15";
const iWKUP_UART1                       = scripting.addPeripheral("WKUP_UART");
iWKUP_UART1.$name                       = "MyWKUP_UART0";
iWKUP_UART1.CTSn.$used                  = false;
iWKUP_UART1.RTSn.$used                  = false;
iWKUP_UART1.RXD.$assign                 = "B14";
iWKUP_UART1.TXD.$assign                 = "A14";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
iDDRSS1.$suggestSolution         = "DDR0";
iDEBUGSS1.$suggestSolution       = "DEBUG0";
iGPIO1.$suggestSolution          = "GPIO0";
iMCU_ADC1.$suggestSolution       = "MCU_ADC0";
iMCU_FSS0_OSPI1.$suggestSolution = "MCU_OSPI0";
iMCU_I3C1.$suggestSolution       = "MCU_I3C0";
iMCU_MDIO1.$suggestSolution      = "MCU_MDIO0";
iMCU_RGMII1.$suggestSolution     = "MCU_RGMII1";
iMCU_UART1.$suggestSolution      = "MCU_USART0";
iMDIO1.$suggestSolution          = "MDIO0";
iOSC1.$suggestSolution           = "OSC1";
iPCIE1.$suggestSolution          = "PCIE1";
iSERDES1.$suggestSolution        = "SERDES0";
iSYSTEM1.$suggestSolution        = "SYSTEM0";
iUSB1.$suggestSolution           = "USB0";
iWKUP_GPIO1.$suggestSolution     = "WKUP_GPIO0";
iWKUP_I2C1.$suggestSolution      = "WKUP_I2C0";
iWKUP_OSC1.$suggestSolution      = "WKUP_OSC0";
iWKUP_SYSTEM1.$suggestSolution   = "WKUP_SYSTEM0";
iWKUP_UART1.$suggestSolution     = "WKUP_USART0";
